![New York City schoolbus](schoolbus.jpg)

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

We have a dataset called `schools.csv`, which is previewed below.

Lets Analyze the schools with best Math scores,best SAT score and the borough with most deviation in the SAT score

In [4]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("schools.csv")

# Preview the data
schools.head()

# Start coding here...
# Add as many cells as you like...

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [6]:
#Get an overview of the data
schools.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   school_name      375 non-null    object
 1   borough          375 non-null    object
 2   building_code    375 non-null    object
 3   average_math     375 non-null    int64
 4   average_reading  375 non-null    int64
 5   average_writing  375 non-null    int64
 6   percent_tested   355 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 20.6+ KB

In [8]:
#Subset the pandas with the required parmaeters
math_school=schools[["school_name","average_math"]]
print(math_school.head())

                                         school_name  average_math
0  New Explorations into Science, Technology and ...           657
1                               Essex Street Academy           395
2                       Lower Manhattan Arts Academy           418
3    High School for Dual Language and Asian Studies           613
4      Henry Street School for International Studies           410

In [10]:
#Sort the values in Descending order
sorted_math_school=math_school.sort_values("average_math",ascending=False)
sorted_math_school.head()

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683

In [12]:
#Filtering the top 10 schools with the best math scores
top_math_schools=sorted_math_school[sorted_math_school["average_math"]>=800*0.8]
best_math_schools=top_math_schools.iloc[:10].sort_values("average_math",ascending= False)
best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

In [14]:
#Making a new Total Sat score column by adding math,reading and writing scores
schools["total_SAT"]=schools["average_math"]+schools["average_reading"]+schools["average_writing"]
school_SAT=schools[["school_name","total_SAT"]]
top_10_schools=school_SAT.sort_values("total_SAT",ascending=False).iloc[0:10]
top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

In [16]:
#Filtering the borough with the most deviation of the SAT score and counting the nu ber of schools in it
import numpy as np
boroughs=schools.groupby("borough")["total_SAT"] .agg(["mean","std","count"]).round(2)
boroughs.round(2)
largest_borough=boroughs[boroughs["std"]==boroughs["std"].max()]
rename_columns={"count":"num_schools","mean":"average_SAT","std":"std_SAT"}
largest_std_dev=largest_borough.rename(columns=rename_columns)
largest_std_dev

           average_SAT  std_SAT  num_schools
borough
Manhattan      1340.13   230.29           89